In [1]:
# 쥬피터노트북 셀 스타일 조절 
from IPython.core.display import display, HTML
display(HTML("<style>.container { font-weight: bold !important; }</style>"))
display(HTML("<style>.container { width: 100% !important; }</style>"))

# 경고 메세지 숨기기 
import warnings
warnings.filterwarnings(action='ignore')

In [2]:
import numpy as np 
import pandas as pd

# 시리즈(Series)

- 리스트와 딕셔너리 두가지의 장점을 섞어놓은 듯한 자료구조
- 리스트나 튜플처럼 숫자인덱싱 
- 딕셔너리와 같이 키인덱싱 
```
pd.Series(data=리스트/튜플/넘파이배열/딕셔너리, index=인덱스리스트)
```

In [22]:
# 딕셔너리 => 시리즈 
mydict = {'a': 1, 'b': 2, 'c': 3, 'd':4, 'e':5}
s1 = pd.Series(data=mydict)
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [23]:
# 인덱싱 
s1['a'] , s1[0] , s1[-1]

(1, 1, 5)

In [24]:
# 슬라이싱 테스트 
print(s1[:2])
print()
print(s1['a':'c'])
print()
print(s1[::2])
print()
print(s1[::-1])
print()

a    1
b    2
dtype: int64

a    1
b    2
c    3
dtype: int64

a    1
c    3
e    5
dtype: int64

e    5
d    4
c    3
b    2
a    1
dtype: int64

In [26]:
# 불연속인 데이타 출력
# 시리즈명[[인덱스1, 인덱스2 .... ]]
print(s1[[0,3,0, 1]])

a    1
d    4
a    1
b    2
dtype: int64

In [15]:
# 넘파이배열 => 시리즈 
matrix = np.arange(10,0,-1)
matrix
s2 = pd.Series(matrix)
s2

0    10
1     9
2     8
3     7
4     6
5     5
6     4
7     3
8     2
9     1
dtype: int32

In [27]:
s2[0], s2[0:5]

(10,
 0    10
 1     9
 2     8
 3     7
 4     6
 dtype: int32)

In [16]:
np.sum(s2), np.mean(s2), np.median(s2), np.min(s2), np.max(s2)

(55, 5.5, 5.5, 1, 10)

In [18]:
# 튜플 => 시리즈 
# 시리즈의 데이터형은 혼합형이 가능하다. 
# 혼합형은 object 
myTuple = ('가', '나', True, 100, 3.14)
myTuple

('가', '나', True, 100, 3.14)

## 시리즈 속성 
- dtype 데이타형 확인 
- values : 값만 넘파이배열 형태로 출력 
- index : 시리즈의 인덱스값만 리스트 형태로 출력

In [28]:
s3 = pd.Series(myTuple)
s3

0       가
1       나
2    True
3     100
4    3.14
dtype: object

In [29]:
s3.dtype, s3.values, s3.index

(dtype('O'),
 array(['가', '나', True, 100, 3.14], dtype=object),
 RangeIndex(start=0, stop=5, step=1))

In [30]:
type(s3[2]), type(s3[3]), type(s3[4])

(bool, int, float)

In [31]:
s3.dtype, s3.values, s3.index

(dtype('O'),
 array(['가', '나', True, 100, 3.14], dtype=object),
 RangeIndex(start=0, stop=5, step=1))

In [32]:
type(s3.values)

numpy.ndarray

In [33]:
s1.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [34]:
list(s1.index), tuple(s1.index)

(['a', 'b', 'c', 'd', 'e'], ('a', 'b', 'c', 'd', 'e'))

## 인덱스 이름, 시리즈 이름 지정 

- 시리즈명.index.name=인덱스이름
- 시리즈명.name=시리즈이름
- 시리즈명.index = 리스트

In [35]:
# 딕셔너리 => 시리즈 
sdata = {"Charles": 35000, "Julia":71000, "Hayoung":16000, "Sangjae":5000}
s4 = pd.Series(sdata, name="보너스")
s4.index.name="회원"
s4

회원
Charles    35000
Julia      71000
Hayoung    16000
Sangjae     5000
Name: 보너스, dtype: int64

In [36]:
s4.name = '상여금'
s4

회원
Charles    35000
Julia      71000
Hayoung    16000
Sangjae     5000
Name: 상여금, dtype: int64

In [37]:
# 리스트 => 시리즈 
# 인덱스명은 별도 설정 
myList = ['라면', '짜장면', '짬뽕', '로제떡볶기']
s5 = pd.Series(myList, index=['메뉴1', '메뉴2', '메뉴3','메뉴4'])
s5

메뉴1       라면
메뉴2      짜장면
메뉴3       짬뽕
메뉴4    로제떡볶기
dtype: object

In [38]:
s5['메뉴3'], s5[2]

('짬뽕', '짬뽕')

## 퀴즈 
```
Quiz 1
1) 딕셔너리 생성 
   {'a': 'apart', 'b': 'banana', 'c': 'cat'}
2) 리스트 생성 
  ['아파트', '바나나', '고양이']
3) 1번의 키값 + 2번의 데이타 => 시리즈생성 
  'a'   '아파트'
  'b'   '바나나'
  'c'   '고양이'
  
  
Quiz 2
아래와 같은 형태로 시리즈를 생성하고 평균값을 출력하여라

과목 
---------
국어    90
수학    80
영어    100
과학    55
역사    70 
Name:중간고사성적표, dtype=?
---------
평균 = ?
```

In [40]:
# Quiz 1
a = {'a': 'apart', 'b': 'banana', 'c': 'cat'}
b = ["아파트", "바나나", "고양이"]
pd.Series(b, index = a.keys())

a    아파트
b    바나나
c    고양이
dtype: object

In [42]:
temp = pd.Series([90,80,100,55,70], index= ["국어", "수학", "영어", "과학", "역사"])
temp.name = "중간고사성적표"
temp.index.name = "과목"

In [44]:
temp

과목
국어     90
수학     80
영어    100
과학     55
역사     70
Name: 중간고사성적표, dtype: int64

# 데이타프레임 생성 

- 딕셔너리 + 리스트 => 데이타프레임 
- 딕셔너리 + 딕셔너리  => 데이타프레임 
- 2차원 리스트  => 데이타프레임 
- 2차원 넘파이배열 => 데이타프레임 
- 2개이상의 시리즈  => 데이타프레임 

```
pd.DataFrame(데이타, columns=컬럼명리스트, index=인덱스리스트)
```

## 2차원 리스트(nested list)를 기반으로 데이터프레임 만들기

In [46]:

data = [ ['Elise', 1.5, 2014],
         ['Julia', 1.7, 2015],
         ['Jhon', 3.6, 2016],
         ['Charles', 2.5, 2017],
         ['Charles', 2.9, 2018] ]

In [47]:
df1 = pd.DataFrame(data, 
                   columns = ['name', 'score', 'year'],
                   index = range(10, 51, 10))
df1

       name  score  year
10    Elise    1.5  2014
20    Julia    1.7  2015
30     Jhon    3.6  2016
40  Charles    2.5  2017
50  Charles    2.9  2018

In [49]:
# 컬럼명 변경 
# 데이타프레임명.columns = 리스트
df1.columns = ['name', 'grade', 'std_id']
df1

       name  grade  std_id
10    Elise    1.5    2014
20    Julia    1.7    2015
30     Jhon    3.6    2016
40  Charles    2.5    2017
50  Charles    2.9    2018

In [51]:
# 인덱스명 수정 
# 데이타프레임명.index = 리스트/range()/넘파이배열
df1.index = np.arange(100, 501, 100)
df1

        name  grade  std_id
100    Elise    1.5    2014
200    Julia    1.7    2015
300     Jhon    3.6    2016
400  Charles    2.5    2017
500  Charles    2.9    2018

In [52]:
## numpy array에서 데이터프레임 만들기
data2 = np.random.randint(1,100,50).reshape(-1,5)
data

[['Elise', 1.5, 2014],
 ['Julia', 1.7, 2015],
 ['Jhon', 3.6, 2016],
 ['Charles', 2.5, 2017],
 ['Charles', 2.9, 2018]]

In [58]:
df2 = pd.DataFrame(data2)
df2

    0   1   2   3   4
0  65  51  70  58  83
1  30  16  78  33  10
2  92  28  26  91  41
3   3  15   5  42  53
4  71  15  65   5  48
5  39  92  49  99  14
6  13  19  98  64  95
7  14  20  21  91  79
8  37  25  11  99   2
9  60  80  81  30  49

In [59]:
# 리스트 for
# [최종값 for i in range(start, end, step)]
[i for i in range(1, 6)]

[1, 2, 3, 4, 5]

In [60]:
df2

    0   1   2   3   4
0  65  51  70  58  83
1  30  16  78  33  10
2  92  28  26  91  41
3   3  15   5  42  53
4  71  15  65   5  48
5  39  92  49  99  14
6  13  19  98  64  95
7  14  20  21  91  79
8  37  25  11  99   2
9  60  80  81  30  49

In [62]:
df2.columns = ['col' + str(i) for i in range(1, 6)]
df2.index = ['row' + str(i) for i in range(1, 11)]
df2

       col1  col2  col3  col4  col5
row1     65    51    70    58    83
row2     30    16    78    33    10
row3     92    28    26    91    41
row4      3    15     5    42    53
row5     71    15    65     5    48
row6     39    92    49    99    14
row7     13    19    98    64    95
row8     14    20    21    91    79
row9     37    25    11    99     2
row10    60    80    81    30    49

##딕셔너리 리스트를 기반으로 데이타프레임 

- 딕셔너리 리스트란?
<br> 딕셔너리의 값이 리스트인 형태 

- 딕셔너리 키가 컬럼명, 딕셔너리 값은 컬럼값 
- 딕셔너리의 값으로 사용되는 리스트의 길이가 같아야한다.

In [64]:
data = {    "name":['Elise', 'Julia', 'Jhon', 'Charles', 'Charles'],
            # "year":[2014, 2015, 2016, 2017, 2018, 2019], # Value Error
            "year":[2014, 2015, 2016, 2017, 2018],
            "points":[1.5, 1.7, 3.6, 2.5, 2.9]}
df3 = pd.DataFrame(data)

df3

      name  year  points
0    Elise  2014     1.5
1    Julia  2015     1.7
2     Jhon  2016     3.6
3  Charles  2017     2.5
4  Charles  2018     2.9

## 이중 딕셔너리(Nested Dictionary)를 기반으로 데이타프레임 

- 이중 딕셔너리(Nested Dictionary)?
<br> 딕셔너리의 값이 딕셔너리인 형태 

- 딕셔너리 키가 컬럼명
- 딕셔너리 값에 있는 딕셔너리의 키는 행이름으로 적용

In [66]:
data = { 'Nevada':{ 2001:2.4, 2002:2.9 },
          'Ohio':{ 2000:1.5, 2001:1.7, 2002:3.6 }, 
           'LA':{ 2003:3.3, 2002:3.6, 2001:1.7,  2000:2.2 } }
df4 = pd.DataFrame(data)
df4

      Nevada  Ohio   LA
2001     2.4   1.7  1.7
2002     2.9   3.6  3.6
2000     NaN   1.5  2.2
2003     NaN   NaN  3.3

## 시리즈의 조합으로 데이타프레임 만들기

pd.DataFrame([시리즈1, 시리즈2...])

In [68]:
s1 = pd.Series({'a':'apple', 'b':'banana', 'c':'cat', 'd':'drama'})
s2 = pd.Series({'a':'apart', 'b':'bat', 'c':'cartoon'})

In [69]:
df5 = pd.DataFrame([s1, s2])
df5

       a       b        c      d
0  apple  banana      cat  drama
1  apart     bat  cartoon    NaN

## 데이타프레임 속성 

```
데이타프레임의 행 요소 조회 – 데이타프레임이름.index
데이타프레임의 열 요소 조회 – 데이타프레임이름.columns
데이타프레임의 요소 값 조회 – 데이타프레임이름.values
데이타프레임의 전체구조 – 데이타프레임이름.shape

```

In [70]:
print(df1)
print()
print(df1.index)
print(df1.columns)
print()
print(df1.values)
print()
print(df1.shape)

        name  grade  std_id
100    Elise    1.5    2014
200    Julia    1.7    2015
300     Jhon    3.6    2016
400  Charles    2.5    2017
500  Charles    2.9    2018

Int64Index([100, 200, 300, 400, 500], dtype='int64')
Index(['name', 'grade', 'std_id'], dtype='object')

[['Elise' 1.5 2014]
 ['Julia' 1.7 2015]
 ['Jhon' 3.6 2016]
 ['Charles' 2.5 2017]
 ['Charles' 2.9 2018]]

(5, 3)

In [71]:
print(df2)
print()
print(df2.index)

       col1  col2  col3  col4  col5
row1     65    51    70    58    83
row2     30    16    78    33    10
row3     92    28    26    91    41
row4      3    15     5    42    53
row5     71    15    65     5    48
row6     39    92    49    99    14
row7     13    19    98    64    95
row8     14    20    21    91    79
row9     37    25    11    99     2
row10    60    80    81    30    49

Index(['row1', 'row2', 'row3', 'row4', 'row5', 'row6', 'row7', 'row8', 'row9',
       'row10'],
      dtype='object')

## 인덱스대표이름과 컬럼대표이름  지정 
- index.name
- columns.name

In [72]:
df2.index.name = "Num"
df2.columns.name = "Info"
df2

Info   col1  col2  col3  col4  col5
Num
row1     65    51    70    58    83
row2     30    16    78    33    10
row3     92    28    26    91    41
row4      3    15     5    42    53
row5     71    15    65     5    48
row6     39    92    49    99    14
row7     13    19    98    64    95
row8     14    20    21    91    79
row9     37    25    11    99     2
row10    60    80    81    30    49

## 데이타프레임 정보 확인 
- 전체갯수, 결측치, 구조, 데이타형태, 통계(편차, 사분위, 평균) 
- 데이타프레임.describe()
- 데이타프레임.info()
- 데이타프레임.dtypes

In [73]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, row1 to row10
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    10 non-null     int32
 1   col2    10 non-null     int32
 2   col3    10 non-null     int32
 3   col4    10 non-null     int32
 4   col5    10 non-null     int32
dtypes: int32(5)
memory usage: 280.0+ bytes

In [74]:
df2.describe()

Info        col1       col2       col3       col4       col5
count  10.000000  10.000000  10.000000  10.000000  10.000000
mean   42.400000  36.100000  50.400000  61.200000  47.400000
std    28.899058  28.497368  32.721722  33.245885  31.941613
min     3.000000  15.000000   5.000000   5.000000   2.000000
25%    18.000000  16.750000  22.250000  35.250000  20.750000
50%    38.000000  22.500000  57.000000  61.000000  48.500000
75%    63.750000  45.250000  76.000000  91.000000  72.500000
max    92.000000  92.000000  98.000000  99.000000  95.000000

In [76]:
# 각 컬럼의 데이타형 확인 
df3.dtypes

name       object
year        int64
points    float64
dtype: object

# 데이타프레임 조회 

- 컬럼 조회 
- 행 조회 
- 컬럼+행 조회 

```
데이타프레임[컬럼명]
데이타프레임[[컬럼명1, 컬럼명2, 컬럼명3 ....]]

데이타프레임.컬럼명 

loc : location 행이름, 컬럼명 
데이타프레임.loc[행이름]
데이타프레임.loc[start:end]
데이타프레임.loc[start:end, start:end]


iloc : index location 행인덱스, 컬럼인덱스
데이타프레임.iloc[행인덱스]
데이타프레임.iloc[start:end]
데이타프레임.iloc[start:end, start:end]

```

In [77]:
data = { "name":["Haidi", "Haidi", "Haidi", "Charles", "Charles"],
        "year":[2014, 2015, 2016, 2015, 2017],
        "points":[1.5, 1.7, 3.6, 2.5, 2.9], 
        "penalty":[1, 2, 3, 4, 5] }
df1 = pd.DataFrame( data, 
                    index=["one", "two", "three", "four", "five"])
df1

          name  year  points  penalty
one      Haidi  2014     1.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [78]:
df1.columns

Index(['name', 'year', 'points', 'penalty'], dtype='object')

In [79]:
df1.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

##### [] 를 이용한 컬럼조회

In [80]:
# 특정 1개의 컬럼 조회 => 시리즈 
# 데이타프레임[컬럼명]
df1['name']

one        Haidi
two        Haidi
three      Haidi
four     Charles
five     Charles
Name: name, dtype: object

In [8]:
type(df1['name'])

pandas.core.series.Series

In [9]:
# 특정 1개의 컬럼 조회 => 데이타프레임
# 데이타프레임[[컬럼명]]
df1[['name']]

          name
one      Haidi
two      Haidi
three    Haidi
four   Charles
five   Charles

In [10]:
type(df1[['name']])

pandas.core.frame.DataFrame

In [12]:
# KeyError 
# df1[0]

In [13]:
# 다수개의 컬럼 조회 => 데이타프레임
# 데이타프레임[[컬럼명1, 컬럼명2 ...]]

In [82]:
df1[['year', 'name', 'points']]

       year     name  points
one    2014    Haidi     1.5
two    2015    Haidi     1.7
three  2016    Haidi     3.6
four   2015  Charles     2.5
five   2017  Charles     2.9

In [14]:
df1

          name  year  points  penalty
one      Haidi  2014     1.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [87]:
# 에러 발생 : 슬라이싱 x
df1[['name','year']]

          name  year
one      Haidi  2014
two      Haidi  2015
three    Haidi  2016
four   Charles  2015
five   Charles  2017

#####  도트(.) 를 이용한 특정 컬럼 조회  => 시리즈

In [21]:
df1.name

one        Haidi
two        Haidi
three      Haidi
four     Charles
five     Charles
Name: name, dtype: object

##### loc 방식으로 컬럼 조회 

- 데이타프레임.loc[:, 컬럼명] => 시리즈 
- 데이타프레임.loc[:, 컬럼명1:컬럼명2] => 데이타프레임

In [94]:
df1.loc[:, 'name']

one        Haidi
two        Haidi
three      Haidi
four     Charles
five     Charles
Name: name, dtype: object

In [23]:
# 컬럼명을 이용한 슬라이싱 
df1.loc[:, 'name':'points']

          name  year  points
one      Haidi  2014     1.5
two      Haidi  2015     1.7
three    Haidi  2016     3.6
four   Charles  2015     2.5
five   Charles  2017     2.9

##### iloc 방식으로 컬럼 조회  : 위치인덱스 숫자 이용

- 데이타프레임.iloc[:, 컬럼인덱스] => 시리즈 
- 데이타프레임.iloc[:, 컬럼인덱스1:컬럼인덱스2] => 데이타프레임

In [96]:
# 특정 컬럼 1개 
df1.iloc[:, 0]

one        Haidi
two        Haidi
three      Haidi
four     Charles
five     Charles
Name: name, dtype: object

In [102]:
mean()

SyntaxError: invalid syntax (<ipython-input-102-900dc0b21562>, line 1)

In [98]:
# 연속 컬럼 슬라이싱 => 데이타프레임
df1.iloc[:, 0:2]

          name  year
one      Haidi  2014
two      Haidi  2015
three    Haidi  2016
four   Charles  2015
five   Charles  2017

##### loc 방식으로 행 조회 
- 데이타프레임.loc[인덱스명] => 시리즈 
- 데이타프레임.loc[[인덱스명]] => 데이타프레임
- 데이타프레임.loc[인덱스명, :] => 시리즈 
- 데이타프레임.loc[인덱스명1:인덱스명2, :] => 데이타프레임
- 데이타프레임.loc[[인덱스명1, 인덱스명2 ...], :] => 데이타프레임

In [32]:
# 특정행 조회 => 시리즈 
df1.loc['three']

name       Haidi
year        2016
points       3.6
penalty        3
Name: three, dtype: object

In [34]:
df1.loc['three', :]

name       Haidi
year        2016
points       3.6
penalty        3
Name: three, dtype: object

In [33]:
# 특정행 조회 => 데이타프레임 
df1.loc[['three']]

        name  year  points  penalty
three  Haidi  2016     3.6        3

In [35]:
# 불연속인 행 조회 - two, five
df1.loc[['two', 'five']]

         name  year  points  penalty
two     Haidi  2015     1.7        2
five  Charles  2017     2.9        5

In [36]:
# 연속적인 행 조회 => 데이타프레임 슬라이싱 
df1.loc['two':'four']

          name  year  points  penalty
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4

##### iloc 방식으로 행 조회  : 위치인덱스 숫자 이용

- 데이타프레임.iloc[행인덱스] => 시리즈 
- 데이타프레임.iloc[행인덱스1:행인덱스2] => 데이타프레임

In [37]:
# 마지막 행 
df1.iloc[-1]

name       Charles
year          2017
points         2.9
penalty          5
Name: five, dtype: object

In [42]:
# 슬라이싱
df1.iloc[1:4]

          name  year  points  penalty
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4

In [43]:
# 불연속인 행 조회 
df1.iloc[[0, 2, -1]]

          name  year  points  penalty
one      Haidi  2014     1.5        1
three    Haidi  2016     3.6        3
five   Charles  2017     2.9        5


##### 데이터 프레임 조회 정리
- 특정행의 특정열 조회 : 슬라이싱
- 데이타프레임명.iloc[start1:end1, start2:end2]
- 데이타프레임명.loc[인덱스명1:인덱스명2, 컬럼명1:컬럼명2]

- 특정행의 특정열의 값 
- 데이타프레임명.iloc[행인덱스, 열인덱스]
- 데이타프레임명.loc[행이름, 열이름]

In [103]:
df1.loc['two':'three', 'name':'year']

        name  year
two    Haidi  2015
three  Haidi  2016

In [104]:
df1.iloc[1:3, 0:2]

        name  year
two    Haidi  2015
three  Haidi  2016

In [105]:
df1.iloc[0, 2], df1.loc['one', 'points']

(1.5, 1.5)

##### 데이터 프레임 조회 메소드

- 맨 앞의 특정행의 갯수 조회 - 데이타프레임명.head(n)
- 맨뒤의 특정행의 갯수 조회 - 데이타프레임명.tail(n)
- n은 기본값 5 
- 무작위 특정행의 갯수 조회 - 데이타프레임명.sample(n)
- n 은 기본값1

In [106]:
data = np.random.randint(1,300,100).reshape(-1,5)
df2 = pd.DataFrame(data)

In [108]:
df2.shape

(20, 5)

In [109]:
df2.head(2)

    0    1    2    3    4
0  16  158  269  242  269
1  84  198  295  190  145

In [111]:
df2.tail(3)

      0    1    2    3   4
17   63  106  217  216  15
18  195  291  169  108  99
19  116  107  130  281  15

In [110]:
df2.sample()

     0    1    2    3    4
9  129  256  276  227  123

In [112]:
df2.sample(3)

      0    1    2    3    4
8    73   32   92  130   52
11   57  209  276   42  202
16  185   56  233   93   28

In [113]:
df2

      0    1    2    3    4
0    16  158  269  242  269
1    84  198  295  190  145
2   281   65   89  228   78
3   231    4  259  116  212
4    77  240    2  200  139
5    85  143  175  101  138
6   262   39  170   90  100
7   249  219  213  210   26
8    73   32   92  130   52
9   129  256  276  227  123
10    3  246  134  148    5
11   57  209  276   42  202
12  131   65   12  231  212
13   86   73   42  269  200
14  124  268  103    3  200
15   41  117  277  166  255
16  185   56  233   93   28
17   63  106  217  216   15
18  195  291  169  108   99
19  116  107  130  281   15

## 행단위 열단위 데이터 추가

- 칼럼추가
```
데이터프레임[새로운 칼럼명] = 리스트, 넘파이 배열/range()
```
- 행추가
```
데이터 프레임.loc[새로운 칼럼명] = 리스트/numpy/range()
```

In [124]:
data = { "name":["Haidi", "Haidi", "Haidi", "Charles", "Charles"],
        "year":[2014, 2015, 2016, 2015, 2017],
        "points":[1.5, 1.7, 3.6, 2.5, 2.9], 
        "penalty":[1, 2, 3, 4, 5] }
df3 = pd.DataFrame( data, 
                    index=["one", "two", "three", "four", "five"])
df3

          name  year  points  penalty
one      Haidi  2014     1.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [125]:
## 새로운 column추가
df3['id'] = 10

In [126]:
df3['addr'] = ["seoul", "ulsan", "pusan", "guangju", "soju"]

In [127]:
df3

          name  year  points  penalty  id     addr
one      Haidi  2014     1.5        1  10    seoul
two      Haidi  2015     1.7        2  10    ulsan
three    Haidi  2016     3.6        3  10    pusan
four   Charles  2015     2.5        4  10  guangju
five   Charles  2017     2.9        5  10     soju

In [128]:
df3['id'] = range(1, len(df3)+1)

In [129]:
df3['bonus'] = df3.points * 100

In [130]:
# 행추가
df3.loc['six'] = ["Charles", 2017, 3.3, 6, 6, "wc", 290.0]

In [131]:
df3.loc['seven'] = ['Haidi', '2020', 3.3, 6, 30, 'WC', 290.0]
df3

          name  year  points  penalty  id     addr  bonus
one      Haidi  2014     1.5        1   1    seoul  150.0
two      Haidi  2015     1.7        2   2    ulsan  170.0
three    Haidi  2016     3.6        3   3    pusan  360.0
four   Charles  2015     2.5        4   4  guangju  250.0
five   Charles  2017     2.9        5   5     soju  290.0
six    Charles  2017     3.3        6   6       wc  290.0
seven    Haidi  2020     3.3        6  30       WC  290.0

In [28]:
# 테스트 : iloc 로 행 삽입이 가능할까?
# IndexError => x
df3.iloc[8] = ['Haidi', '2020년', 3.3, 6, 30, 'WC', 290.0]
df3

IndexError: iloc cannot enlarge its target object

In [132]:
df3.loc['eight'] = ['Haidi', '2020년', 3.3, 6, 30, 'WC', 290.0]

In [133]:
df3.dtypes

name        object
year        object
points     float64
penalty      int64
id           int64
addr        object
bonus      float64
dtype: object

## 기존 값 수정하기 

```
데이타프레임.loc[행명, 열명] = 새로운값
데이타프레임.iloc[행인덱스, 열인덱스] = 새로운값


```

In [29]:
df3.loc['one', 'name'] = 'Julia'

In [30]:
df3.iloc[-1, -1] = 500
# 개별 값도 업데이트 가능하다.

In [31]:
# 슬라이싱한 상태에서 값 교체 
df3.loc['one':'three', 'penalty'] = -500

In [134]:
df3.shape

(8, 7)

In [135]:
df3.shape[0]

8

In [136]:
np.arange(0, df3.shape[0])

array([0, 1, 2, 3, 4, 5, 6, 7])

In [138]:
# 특정 컬럼 전체의 값 교체 
df3['id'] = np.arange(1, df3.shape[0]+1)*10

In [141]:
df3

          name   year  points  penalty  id     addr  bonus
one      Haidi   2014     1.5        1   1    seoul  150.0
two      Haidi   2015     1.7        2   2    ulsan  170.0
three    Haidi   2016     3.6        3   3    pusan  360.0
four   Charles   2015     2.5        4   4  guangju  250.0
five   Charles   2017     2.9        5   5     soju  290.0
six    Charles   2017     3.3        6   6       wc  290.0
seven    Haidi   2020     3.3        6   7       WC  290.0
eight    Haidi  2020년     3.3        6   8       WC  290.0

In [140]:
df3.id = np.arange(1, len(df3.id)+1)

In [142]:
df3

          name   year  points  penalty  id     addr  bonus
one      Haidi   2014     1.5        1   1    seoul  150.0
two      Haidi   2015     1.7        2   2    ulsan  170.0
three    Haidi   2016     3.6        3   3    pusan  360.0
four   Charles   2015     2.5        4   4  guangju  250.0
five   Charles   2017     2.9        5   5     soju  290.0
six    Charles   2017     3.3        6   6       wc  290.0
seven    Haidi   2020     3.3        6   7       WC  290.0
eight    Haidi  2020년     3.3        6   8       WC  290.0

## 행과 열 삭제

- 열 삭제
<br>inplace=True 를 지정하면 원본에 바로 적용 
```
df.drop(colname, axis = 1, inplace = True)
df.drop([colname1, colname2...], axis =1, inplace = True)
```
<br> del 데이타프레임명[컬럼명]
```
del.df[colname]
```

- 행 삭제

```
df.drop(인덱스명, axis = 0, inplace = True)
df.drop([index1, index2...], axis = 0, inplace = True)
```

In [143]:
data = { "name":["Haidi", "Haidi", "Haidi", "Charles", "Charles"],
        "year":[2014, 2015, 2016, 2015, 2017],
        "points":[1.5, 1.7, 3.6, 2.5, 2.9], 
        "penalty":[1, 2, 3, 4, 5] }
df4 = pd.DataFrame( data, 
                    index=["one", "two", "three", "four", "five"])
df4

          name  year  points  penalty
one      Haidi  2014     1.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [144]:
del df4['penalty']

In [146]:
df4

          name  year  points
one      Haidi  2014     1.5
two      Haidi  2015     1.7
three    Haidi  2016     3.6
four   Charles  2015     2.5
five   Charles  2017     2.9

In [53]:
df4.drop('year', axis = 1, inplace = True)

##inplace를 해야 본판이 삭제된다.

In [54]:
df4.drop(['name', 'points'], axis = 1)

Empty DataFrame
Columns: []
Index: [one, two, three, four, five]

In [56]:
df4.drop(['two', "five"])

          name  points
one      Haidi     1.5
three    Haidi     3.6
four   Charles     2.5

## df의 복사

- 깊은 복사, 얕은 복사(https://blueshw.github.io/2016/01/20/shallow-copy-deep-copy/)

 * 얕은 복사는? 
     복사본이나 원본이 같은 메모리 번지를 사용. <br>
     서로 데이터가 연결되어 있음
 * 깊은 복사는?
     복사본이나 원본이 서로 다른 메모리번지 사용.
     copy()

In [57]:
data = { "name":["Haidi", "Haidi", "Haidi", "Charles", "Charles"],
        "year":[2014, 2015, 2016, 2015, 2017],
        "points":[1.5, 1.7, 3.6, 2.5, 2.9], 
        "penalty":[1, 2, 3, 4, 5] }
df5 = pd.DataFrame( data, 
                    index=["one", "two", "three", "four", "five"])

In [58]:
df5

          name  year  points  penalty
one      Haidi  2014     1.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [68]:
## 얕은 복사 방식으로 복제본 생성
df6 = df5

In [69]:
df6

          name  year  points  penalty
one      Haidi  2014     1.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [75]:
df6.loc['one', "name"] = "홍길동"
df6.iloc[1,2] = 5.5

In [76]:
df6

          name  year  points  penalty
one        홍길동  2014     1.5        1
two      Haidi  2015     5.5        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [77]:
df5

          name  year  points  penalty
one        홍길동  2014     1.5        1
two      Haidi  2015     5.5        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [78]:
## 깊은 복사 방식으로 복사본 생성

df7 = df5.copy()

In [79]:
df7

          name  year  points  penalty
one        홍길동  2014     1.5        1
two      Haidi  2015     5.5        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [80]:
df7.iloc[-1, -1] = 500
df7

          name  year  points  penalty
one        홍길동  2014     1.5        1
two      Haidi  2015     5.5        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9      500

In [81]:
df5

          name  year  points  penalty
one        홍길동  2014     1.5        1
two      Haidi  2015     5.5        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

## 조건식에 맞는 필터링 방법 => numpy와 비슷하게 불린 인덱싱

```
df[조건절]
>= , <=, ==, !=, &, |
조건절에 true인 것들이 필터링 되어 나옴.

```

In [82]:
data = { "year":[2014, 2015, 2016, 2015, 2017,2013]
,"name":['Haidi', 'Haidi', 'Haidi', 'Charles', 'Charles', 'Hayoung']
, "points":[1.5, 1.7, 3.6, 2.5, 2.9, 4.0]
, "penalty":[0.1,0.2, 0.3,0.4,0.5,0.1 ]
, "net_points":[1.4,1.5,3.3,2.1,2.4,2.1]
, "bonus":[10,20,30,40,50,60]}
df = pd.DataFrame(data, 
columns=["year","name","points","penalty","net_points","bonus"],
index=["one", "two", "three", "four", "five","six"])

In [90]:
df

       year     name  points  penalty  net_points  bonus
one    2014    Haidi     1.5      0.1         1.4     10
two    2015    Haidi     1.7      0.2         1.5     20
three  2016    Haidi     3.6      0.3         3.3     30
four   2015  Charles     2.5      0.4         2.1     40
five   2017  Charles     2.9      0.5         2.4     50
six    2013  Hayoung     4.0      0.1         2.1     60

In [85]:
df[df.name == 'Haidi']

       year   name  points  penalty  net_points  bonus
one    2014  Haidi     1.5      0.1         1.4     10
two    2015  Haidi     1.7      0.2         1.5     20
three  2016  Haidi     3.6      0.3         3.3     30

In [93]:
# penalty가 0.3 이상이면서, name이 'charles'인 경우
df[(df['penalty'] >= 0.3) & (df['name'] == "Charles")]

      year     name  points  penalty  net_points  bonus
four  2015  Charles     2.5      0.4         2.1     40
five  2017  Charles     2.9      0.5         2.4     50

# csv, tsv파일을 데이터 프레임으로

In [94]:
ls

 C 드라이브의 볼륨: OS
 볼륨 일련 번호: BEAD-E4AA

 C:\Users\13a71\Dropbox\python숙달 디렉터리

2021-11-25  오후 04:30    <DIR>          .
2021-11-25  오후 04:30    <DIR>          ..
2021-11-25  오후 02:32    <DIR>          .ipynb_checkpoints
2021-11-23  오전 09:36    <DIR>          CODING TEST
2021-11-25  오후 04:30    <DIR>          data
2021-11-24  오후 03:59           112,846 day102_np.ipynb
2021-11-23  오전 11:32    <DIR>          numpy
2021-11-25  오후 01:22            55,230 NUMPY.ipynb
2021-11-25  오전 10:17            61,710 Numpy_Quiz.ipynb
2021-11-24  오후 03:31    <DIR>          output
2021-11-25  오후 02:29           125,857 pandas.ipynb
2021-11-25  오후 04:30            98,755 pandas_te.ipynb
               5개 파일             454,398 바이트
               7개 디렉터리  12,702,535,680 바이트 남음

In [98]:
df_inchon = pd.read_csv('data/population_in_Inchon.csv', encoding='cp949')

In [99]:
df_inchon

    군  구  주 민 등 록 인 구(남)  주 민 등 록 인 구(여)  주 민 등 록 인 구(세대수)  외 국 인(남)  외 국 인(여)
0  중   구           62202           57227             55952      2006      1886
1  동   구           33875           33312             29153       518       391
2  남   구          211021          207512            183418      4281      4235
3    연수구          169121          170806            126408      4386      4862
4    남동구          268451          270525            217621      8370      3824
5    부평구          262855          266867            213270      6602      6178
6    계양구          157731          158190            124349      1396      1775
7  서   구          269966          264198            208064      8331      3793
8    강화군           34498           34274             32202       495       278
9    옹진군           12010            9200             11746       130        54

In [100]:
# '군  구', '주 민 등 록 인 구(세대수)' 컬럼 출력 
df_inchon[['군  구', '주 민 등 록 인 구(세대수)']]

    군  구  주 민 등 록 인 구(세대수)
0  중   구             55952
1  동   구             29153
2  남   구            183418
3    연수구            126408
4    남동구            217621
5    부평구            213270
6    계양구            124349
7  서   구            208064
8    강화군             32202
9    옹진군             11746

In [101]:
# 외 국 인(여) 컬럼값이 4000 이상 
df_inchon[df_inchon['외 국 인(여)'] > 4000]

    군  구  주 민 등 록 인 구(남)  주 민 등 록 인 구(여)  주 민 등 록 인 구(세대수)  외 국 인(남)  외 국 인(여)
2  남   구          211021          207512            183418      4281      4235
3    연수구          169121          170806            126408      4386      4862
5    부평구          262855          266867            213270      6602      6178

In [102]:
# 외국인 컬럼 추가 => '외 국 인(남)'+ '외 국 인(여)'
df_inchon['외국인'] = df_inchon['외 국 인(여)']+df_inchon['외 국 인(남)']

In [103]:
df_inchon['외국인'] = df_inchon['외 국 인(여)']+df_inchon['외 국 인(남)']

In [106]:
# '외 국 인(남)'+ '외 국 인(여)' 컬럼 삭제 
df_inchon.drop(['외 국 인(남)','외 국 인(여)'], inplace=True, axis=1)

In [107]:
df_inchon

    군  구  주 민 등 록 인 구(남)  주 민 등 록 인 구(여)  주 민 등 록 인 구(세대수)    외국인
0  중   구           62202           57227             55952   3892
1  동   구           33875           33312             29153    909
2  남   구          211021          207512            183418   8516
3    연수구          169121          170806            126408   9248
4    남동구          268451          270525            217621  12194
5    부평구          262855          266867            213270  12780
6    계양구          157731          158190            124349   3171
7  서   구          269966          264198            208064  12124
8    강화군           34498           34274             32202    773
9    옹진군           12010            9200             11746    184

In [108]:
df_inchon.describe()

       주 민 등 록 인 구(남)  주 민 등 록 인 구(여)  주 민 등 록 인 구(세대수)          외국인
count       10.000000       10.000000         10.000000     10.00000
mean    148173.000000   147211.100000     120218.300000   6379.10000
std     104801.268158   105617.357956      82897.864944   5129.35533
min      12010.000000     9200.000000      11746.000000    184.00000
25%      41424.000000    40012.250000      38139.500000   1474.50000
50%     163426.000000   164498.000000     125378.500000   6204.00000
75%     249896.500000   250026.500000     201902.500000  11405.00000
max     269966.000000   270525.000000     217621.000000  12780.00000

In [109]:
# 외국인 컬럼의 분위수 정보 출력
df_inchon.describe().loc['25%':'75%', '외국인']

25%     1474.5
50%     6204.0
75%    11405.0
Name: 외국인, dtype: float64

In [110]:
df_inchon.describe().loc['25%':'75%', ['외국인']]

         외국인
25%   1474.5
50%   6204.0
75%  11405.0

#####  tsv 파일 => 데이타프레임 

```
tab seperate value 
sep='\t' 로 지정 
pd.read_csv('data/gapminder.tsv', encoding='cp949', sep='\t')

In [149]:
gapminder = pd.read_csv('data/gapminder.tsv', encoding='cp949', sep='\t')

In [150]:
# 2007 년도 데이타만 출력 
gapminder[gapminder['year'] == 2007]

                 country continent  year  lifeExp       pop     gdpPercap
11           Afghanistan      Asia  2007   43.828  31889923    974.580338
23               Albania    Europe  2007   76.423   3600523   5937.029526
35               Algeria    Africa  2007   72.301  33333216   6223.367465
47                Angola    Africa  2007   42.731  12420476   4797.231267
59             Argentina  Americas  2007   75.320  40301927  12779.379640
...                  ...       ...   ...      ...       ...           ...
1655             Vietnam      Asia  2007   74.249  85262356   2441.576404
1667  West Bank and Gaza      Asia  2007   73.422   4018332   3025.349798
1679         Yemen, Rep.      Asia  2007   62.698  22211743   2280.769906
1691              Zambia    Africa  2007   42.384  11746035   1271.211593
1703            Zimbabwe    Africa  2007   43.487  12311143    469.709298

[142 rows x 6 columns]

In [124]:
gapminder['continent'].unique()

array(['Asia', 'Europe', 'Africa', 'Americas', 'Oceania'], dtype=object)

In [125]:
eu = gapminder[gapminder.continent == "Europe"]

In [128]:
eu[eu.lifeExp == max(eu.lifeExp)]

     country continent  year  lifeExp     pop    gdpPercap
695  Iceland    Europe  2007   81.757  301931  36180.78919

## quiz 1

1) gapminder.tsv 파일을 이용하여 데이타프레임을 생성하고 
   'Asia' 만 행 추출하여 새로운 데이타프레임으로 저장하여라
2) 1번에서 생성한 데이타프레임의 총 행수는?
3) 1번에서 생성한 데이타프레임에서 year 년도가 (1970~1979)년도의 행만 출력하여라
4) 3번의 결과행을 2번의 데이타프레임에서 제외한후 출력하여라
5) 1번의 데이타프레임에서 gdpPercap 컬럼값이 가장 높은 나라의 정보를 출력하여라 
6) 1번의 데이타프레임에서 lifeExp	 컬럼값이 가장 높은 나라는?
7) 1번의 데이타프레임에서 pop 컬럼의 평균 이상인 나라의 총수는?

In [129]:
#1) df 데이타프레임에서 'Asia' 만 행 추출하여 새로운 데이타프레임으로 저장하여라

asia = gapminder[gapminder.continent =="Asia"]

In [170]:
#2) 1번에서 생성한 데이타프레임의 총 행수는?
len(asia)

396

In [171]:
#3. 1번에서 생성한 데이타프레임에서 year 년도가 (1970~1979)년도의 행만 출력하여라

asia[(asia.year < 1979) & (asia.year > 1970)]

          country continent  year  lifeExp       pop    gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333   779.445314
1     Afghanistan      Asia  1957   30.332   9240934   820.853030
2     Afghanistan      Asia  1962   31.997  10267083   853.100710
3     Afghanistan      Asia  1967   34.020  11537966   836.197138
4     Afghanistan      Asia  1972   36.088  13079460   739.981106
...           ...       ...   ...      ...       ...          ...
1669  Yemen, Rep.      Asia  1957   33.970   5498090   804.830455
1670  Yemen, Rep.      Asia  1962   35.180   6120081   825.623201
1671  Yemen, Rep.      Asia  1967   36.984   6740785   862.442146
1672  Yemen, Rep.      Asia  1972   39.848   7407075  1265.047031
1673  Yemen, Rep.      Asia  1977   44.175   8403990  1829.765177

[198 rows x 6 columns]

In [137]:
# 4) 3번의 결과행을 2번의 데이타프레임에서 제외한후 출력하여라

In [160]:
asia.year.unique()

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)

In [181]:
asia[~((asia.year < 1979) & (asia.year > 1970))]

          country continent  year  lifeExp       pop    gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333   779.445314
1     Afghanistan      Asia  1957   30.332   9240934   820.853030
2     Afghanistan      Asia  1962   31.997  10267083   853.100710
3     Afghanistan      Asia  1967   34.020  11537966   836.197138
6     Afghanistan      Asia  1982   39.854  12881816   978.011439
...           ...       ...   ...      ...       ...          ...
1675  Yemen, Rep.      Asia  1987   52.922  11219340  1971.741538
1676  Yemen, Rep.      Asia  1992   55.599  13367997  1879.496673
1677  Yemen, Rep.      Asia  1997   58.020  15826497  2117.484526
1678  Yemen, Rep.      Asia  2002   60.308  18701257  2234.820827
1679  Yemen, Rep.      Asia  2007   62.698  22211743  2280.769906

[330 rows x 6 columns]

In [175]:
df1 = asia[(asia.year < 1970)]
df2 = asia[(asia.year > 1979)]

In [179]:
com = pd.concat([df1,df2])

In [145]:
#5) 1번의 데이타프레임에서 gdpPercap 컬럼값이 가장 높은 나라의 정보를 출력하여라 

asia[asia.gdpPercap == asia.gdpPercap.max()]

    country continent  year  lifeExp     pop    gdpPercap
853  Kuwait      Asia  1957   58.033  212846  113523.1329

In [157]:
#6) 1번의 데이타프레임에서 lifeExp    컬럼값이 가장 높은 나라는?

asia[asia.lifeExp == asia.lifeExp.max()].country

803    Japan
Name: country, dtype: object

In [156]:
# 7) 1번의 데이타프레임에서 pop 컬럼의 평균값 이상인 나라의 총수는?
len(asia[asia['pop'] > asia['pop'].mean()].country.unique())

8

In [152]:
asia['pop'].mean()

77038721.97222222

# 자료형 변경

- 묵시적 형변환: 자동 => 정수 < 실수 < 문자
- 강제적 형변환

```
실수 -> 정수
실수, 정수 -> 문자열
문자열 숫자 => 숫자
  pd.to_numeric(_)
날짜 스타일 문자열 2021-07-31, 20211126 => 시계열 데이터
  pd.to_datetime()
```

In [162]:
data = np.arange(1, 51).reshape(-1, 5)

collist = ['col' +str(a) for a in range(1,6)]

rowlist = ["row" + str(a) for a in range(1,11)]

df1= pd.DataFrame(data, columns =collist, index = rowlist)

df1

       col1  col2  col3  col4  col5
row1      1     2     3     4     5
row2      6     7     8     9    10
row3     11    12    13    14    15
row4     16    17    18    19    20
row5     21    22    23    24    25
row6     26    27    28    29    30
row7     31    32    33    34    35
row8     36    37    38    39    40
row9     41    42    43    44    45
row10    46    47    48    49    50

In [163]:
# 실수형 데이타 삽입 => 값이 교체된 컬럼의 데이타형이 실수형으로 자동 변경 
df1.loc['row1', 'col1'] = 3.14
df1

        col1  col2  col3  col4  col5
row1    3.14     2     3     4     5
row2    6.00     7     8     9    10
row3   11.00    12    13    14    15
row4   16.00    17    18    19    20
row5   21.00    22    23    24    25
row6   26.00    27    28    29    30
row7   31.00    32    33    34    35
row8   36.00    37    38    39    40
row9   41.00    42    43    44    45
row10  46.00    47    48    49    50

In [164]:
df1.dtypes

col1    float64
col2      int32
col3      int32
col4      int32
col5      int32
dtype: object

In [165]:
# 문자형 데이타 삽입 => 값이 교체된 컬럼의 데이타형이 문자열형으로 자동 변경 
df1.loc['row1', 'col2'] = 'Python'
df1.loc['row1', 'col3'] = 'Python'
df1

        col1    col2    col3  col4  col5
row1    3.14  Python  Python     4     5
row2    6.00       7       8     9    10
row3   11.00      12      13    14    15
row4   16.00      17      18    19    20
row5   21.00      22      23    24    25
row6   26.00      27      28    29    30
row7   31.00      32      33    34    35
row8   36.00      37      38    39    40
row9   41.00      42      43    44    45
row10  46.00      47      48    49    50

In [166]:
df1.dtypes

col1    float64
col2     object
col3     object
col4      int32
col5      int32
dtype: object

In [167]:
# ValueError => astype(int)메서드를 사용할려면 컬럼값이 모두 숫자형태의 문자이어야한다. 
df1['col3'].astype(int)

ValueError: invalid literal for int() with base 10: 'Python'

In [169]:
# errors='coerce' 만약 숫자문자가 아니라면 NaN 결측값 삽입 
pd.to_numeric(df1['col3'], errors='coerce')

row1      NaN
row2      8.0
row3     13.0
row4     18.0
row5     23.0
row6     28.0
row7     33.0
row8     38.0
row9     43.0
row10    48.0
Name: col3, dtype: float64

In [170]:
# 원본 컬럼에 결과값 반영 
df1['col3'] = pd.to_numeric(df1['col3'], errors='coerce')

In [171]:
df1.dtypes

col1    float64
col2     object
col3    float64
col4      int32
col5      int32
dtype: object

In [172]:
df1

        col1    col2  col3  col4  col5
row1    3.14  Python   NaN     4     5
row2    6.00       7   8.0     9    10
row3   11.00      12  13.0    14    15
row4   16.00      17  18.0    19    20
row5   21.00      22  23.0    24    25
row6   26.00      27  28.0    29    30
row7   31.00      32  33.0    34    35
row8   36.00      37  38.0    39    40
row9   41.00      42  43.0    44    45
row10  46.00      47  48.0    49    50

In [173]:
# 실수 => 정수 
df1['col1'].astype(int)

row1      3
row2      6
row3     11
row4     16
row5     21
row6     26
row7     31
row8     36
row9     41
row10    46
Name: col1, dtype: int32

In [174]:
# 원본에 반영 
df1['col1'] = df1['col1'].astype(int)

## 판다스의 문자열 처리

데이타프레임[컬럼명].str.함수명()
<br>
데이타프레임[컬럼명].inin()

In [175]:
df_gap = pd.read_csv('data/gapminder.tsv', sep='\t')

In [176]:
df_gap.sample(5)

                    country continent  year  lifeExp         pop     gdpPercap
1203                   Peru  Americas  1967   51.445    12132200   5788.093330
90                  Bahrain      Asia  1982   69.052      377967  19211.147310
295                   China      Asia  1987   67.274  1084035000   1378.904018
1638              Venezuela  Americas  1982   68.557    15620766  11152.410110
1298  Sao Tome and Principe    Africa  1962   51.893       65345   1071.551119

### korea, KOREA 글자가 들어간 데이타를 추출하려면?

In [177]:
# 국가 목록 
df_gap['country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong Kong, China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea, Dem. Rep.',
       'Korea, Rep.', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Sierra Leone', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United Kingdom', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen, Rep.',
       'Zambia', 'Zimbabwe'], dtype=object)

In [178]:
# 'Korea, Dem. Rep.' , 'Korea, Rep.' 국가의 데이타만 출력 
df_gap[(df_gap['country'] == 'Korea, Dem. Rep.') | (df_gap['country'] == 'Korea, Rep.')]

              country continent  year  lifeExp       pop     gdpPercap
828  Korea, Dem. Rep.      Asia  1952   50.056   8865488   1088.277758
829  Korea, Dem. Rep.      Asia  1957   54.081   9411381   1571.134655
830  Korea, Dem. Rep.      Asia  1962   56.656  10917494   1621.693598
831  Korea, Dem. Rep.      Asia  1967   59.942  12617009   2143.540609
832  Korea, Dem. Rep.      Asia  1972   63.983  14781241   3701.621503
833  Korea, Dem. Rep.      Asia  1977   67.159  16325320   4106.301249
834  Korea, Dem. Rep.      Asia  1982   69.100  17647518   4106.525293
835  Korea, Dem. Rep.      Asia  1987   70.647  19067554   4106.492315
836  Korea, Dem. Rep.      Asia  1992   69.978  20711375   3726.063507
837  Korea, Dem. Rep.      Asia  1997   67.727  21585105   1690.756814
838  Korea, Dem. Rep.      Asia  2002   66.662  22215365   1646.758151
839  Korea, Dem. Rep.      Asia  2007   67.297  23301725   1593.065480
840       Korea, Rep.      Asia  1952   47.453  20947571   1030.592226
841       Korea, Rep.      Asia  1957   52.681  22611552   1487.593537
842       Korea, Rep.      Asia  1962   55.292  26420307   1536.344387
843       Korea, Rep.      Asia  1967   57.716  30131000   2029.228142
844       Korea, Rep.      Asia  1972   62.612  33505000   3030.876650
845       Korea, Rep.      Asia  1977   64.766  36436000   4657.221020
846       Korea, Rep.      Asia  1982   67.123  39326000   5622.942464
847       Korea, Rep.      Asia  1987   69.810  41622000   8533.088805
848       Korea, Rep.      Asia  1992   72.244  43805450  12104.278720
849       Korea, Rep.      Asia  1997   74.647  46173816  15993.527960
850       Korea, Rep.      Asia  2002   77.045  47969150  19233.988180
851       Korea, Rep.      Asia  2007   78.623  49044790  23348.139730

In [179]:
df_gap[df_gap['country'].isin(['Korea, Dem. Rep.', 'Korea, Rep.'])]

              country continent  year  lifeExp       pop     gdpPercap
828  Korea, Dem. Rep.      Asia  1952   50.056   8865488   1088.277758
829  Korea, Dem. Rep.      Asia  1957   54.081   9411381   1571.134655
830  Korea, Dem. Rep.      Asia  1962   56.656  10917494   1621.693598
831  Korea, Dem. Rep.      Asia  1967   59.942  12617009   2143.540609
832  Korea, Dem. Rep.      Asia  1972   63.983  14781241   3701.621503
833  Korea, Dem. Rep.      Asia  1977   67.159  16325320   4106.301249
834  Korea, Dem. Rep.      Asia  1982   69.100  17647518   4106.525293
835  Korea, Dem. Rep.      Asia  1987   70.647  19067554   4106.492315
836  Korea, Dem. Rep.      Asia  1992   69.978  20711375   3726.063507
837  Korea, Dem. Rep.      Asia  1997   67.727  21585105   1690.756814
838  Korea, Dem. Rep.      Asia  2002   66.662  22215365   1646.758151
839  Korea, Dem. Rep.      Asia  2007   67.297  23301725   1593.065480
840       Korea, Rep.      Asia  1952   47.453  20947571   1030.592226
841       Korea, Rep.      Asia  1957   52.681  22611552   1487.593537
842       Korea, Rep.      Asia  1962   55.292  26420307   1536.344387
843       Korea, Rep.      Asia  1967   57.716  30131000   2029.228142
844       Korea, Rep.      Asia  1972   62.612  33505000   3030.876650
845       Korea, Rep.      Asia  1977   64.766  36436000   4657.221020
846       Korea, Rep.      Asia  1982   67.123  39326000   5622.942464
847       Korea, Rep.      Asia  1987   69.810  41622000   8533.088805
848       Korea, Rep.      Asia  1992   72.244  43805450  12104.278720
849       Korea, Rep.      Asia  1997   74.647  46173816  15993.527960
850       Korea, Rep.      Asia  2002   77.045  47969150  19233.988180
851       Korea, Rep.      Asia  2007   78.623  49044790  23348.139730

In [180]:
# 데이타프레임[컬럼명].isin([값1, 값2 ...])
df_gap['country'].isin(['Korea, Dem. Rep.', 'Korea, Rep.'])

0       False
1       False
2       False
3       False
4       False
        ...
1699    False
1700    False
1701    False
1702    False
1703    False
Name: country, Length: 1704, dtype: bool

In [181]:
df_gap[(df_gap['country'] == 'Korea, Dem. Rep.') | (df_gap['country'] == 'Korea, Rep.')].count()

country      24
continent    24
year         24
lifeExp      24
pop          24
gdpPercap    24
dtype: int64

In [182]:
df_gap[df_gap['country'].isin(['Korea, Dem. Rep.', 'Korea, Rep.'])].count()

country      24
continent    24
year         24
lifeExp      24
pop          24
gdpPercap    24
dtype: int64

In [183]:
# 컬럼값과 동일해야만 필터링이 된다. 
df_gap[df_gap['country'].isin(['Korea'])]

Empty DataFrame
Columns: [country, continent, year, lifeExp, pop, gdpPercap]
Index: []

In [184]:
df_gap[df_gap['country'] == 'Korea']

Empty DataFrame
Columns: [country, continent, year, lifeExp, pop, gdpPercap]
Index: []

In [185]:
# 모두 소문자로 출력 
df_gap['country'].str.lower()

0       afghanistan
1       afghanistan
2       afghanistan
3       afghanistan
4       afghanistan
           ...
1699       zimbabwe
1700       zimbabwe
1701       zimbabwe
1702       zimbabwe
1703       zimbabwe
Name: country, Length: 1704, dtype: object

In [186]:
# 첫번째 글자만 출력 
df_gap['country'].str[0]

0       A
1       A
2       A
3       A
4       A
       ..
1699    Z
1700    Z
1701    Z
1702    Z
1703    Z
Name: country, Length: 1704, dtype: object

In [187]:
# 5개의 글자만 추출 
df_gap['country'].str[:5]

0       Afgha
1       Afgha
2       Afgha
3       Afgha
4       Afgha
        ...
1699    Zimba
1700    Zimba
1701    Zimba
1702    Zimba
1703    Zimba
Name: country, Length: 1704, dtype: object

In [188]:
# Korea 가 들어간 데이타?
df_gap[df_gap['country'].str.contains('Korea')]

              country continent  year  lifeExp       pop     gdpPercap
828  Korea, Dem. Rep.      Asia  1952   50.056   8865488   1088.277758
829  Korea, Dem. Rep.      Asia  1957   54.081   9411381   1571.134655
830  Korea, Dem. Rep.      Asia  1962   56.656  10917494   1621.693598
831  Korea, Dem. Rep.      Asia  1967   59.942  12617009   2143.540609
832  Korea, Dem. Rep.      Asia  1972   63.983  14781241   3701.621503
833  Korea, Dem. Rep.      Asia  1977   67.159  16325320   4106.301249
834  Korea, Dem. Rep.      Asia  1982   69.100  17647518   4106.525293
835  Korea, Dem. Rep.      Asia  1987   70.647  19067554   4106.492315
836  Korea, Dem. Rep.      Asia  1992   69.978  20711375   3726.063507
837  Korea, Dem. Rep.      Asia  1997   67.727  21585105   1690.756814
838  Korea, Dem. Rep.      Asia  2002   66.662  22215365   1646.758151
839  Korea, Dem. Rep.      Asia  2007   67.297  23301725   1593.065480
840       Korea, Rep.      Asia  1952   47.453  20947571   1030.592226
841       Korea, Rep.      Asia  1957   52.681  22611552   1487.593537
842       Korea, Rep.      Asia  1962   55.292  26420307   1536.344387
843       Korea, Rep.      Asia  1967   57.716  30131000   2029.228142
844       Korea, Rep.      Asia  1972   62.612  33505000   3030.876650
845       Korea, Rep.      Asia  1977   64.766  36436000   4657.221020
846       Korea, Rep.      Asia  1982   67.123  39326000   5622.942464
847       Korea, Rep.      Asia  1987   69.810  41622000   8533.088805
848       Korea, Rep.      Asia  1992   72.244  43805450  12104.278720
849       Korea, Rep.      Asia  1997   74.647  46173816  15993.527960
850       Korea, Rep.      Asia  2002   77.045  47969150  19233.988180
851       Korea, Rep.      Asia  2007   78.623  49044790  23348.139730

In [189]:
df_gap['country']

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [190]:
# land 들어간 나라의 데이타 출력?
df_gap[df_gap['country'].str.contains('land')]

       country continent  year  lifeExp       pop     gdpPercap
516    Finland    Europe  1952   66.550   4090500   6424.519071
517    Finland    Europe  1957   67.490   4324000   7545.415386
518    Finland    Europe  1962   68.750   4491443   9371.842561
519    Finland    Europe  1967   69.830   4605744  10921.636260
520    Finland    Europe  1972   70.870   4639657  14358.875900
...        ...       ...   ...      ...       ...           ...
1531  Thailand      Asia  1987   66.084  52910342   2982.653773
1532  Thailand      Asia  1992   67.298  56667095   4616.896545
1533  Thailand      Asia  1997   67.521  60216677   5852.625497
1534  Thailand      Asia  2002   68.564  62806748   5913.187529
1535  Thailand      Asia  2007   70.616  65068149   7458.396327

[108 rows x 6 columns]

In [191]:
df_gap[df_gap['country'].str.contains('land')]['country'].unique()

array(['Finland', 'Iceland', 'Ireland', 'Netherlands', 'New Zealand',
       'Poland', 'Swaziland', 'Switzerland', 'Thailand'], dtype=object)

In [192]:
# land, an 글자가 들어간 데이타 목록 
df_gap[df_gap['country'].str.contains('land|an')]

                 country continent  year  lifeExp       pop    gdpPercap
0            Afghanistan      Asia  1952   28.801   8425333   779.445314
1            Afghanistan      Asia  1957   30.332   9240934   820.853030
2            Afghanistan      Asia  1962   31.997  10267083   853.100710
3            Afghanistan      Asia  1967   34.020  11537966   836.197138
4            Afghanistan      Asia  1972   36.088  13079460   739.981106
...                  ...       ...   ...      ...       ...          ...
1663  West Bank and Gaza      Asia  1987   67.046   1691210  5107.197384
1664  West Bank and Gaza      Asia  1992   69.718   2104779  6017.654756
1665  West Bank and Gaza      Asia  1997   71.096   2826046  7110.667619
1666  West Bank and Gaza      Asia  2002   72.370   3389578  4515.487575
1667  West Bank and Gaza      Asia  2007   73.422   4018332  3025.349798

[468 rows x 6 columns]

In [193]:
df_gap[df_gap['country'].str.contains('land|an')]['country'].unique()

array(['Afghanistan', 'Albania', 'Bangladesh', 'Bosnia and Herzegovina',
       'Botswana', 'Canada', 'Central African Republic',
       'Dominican Republic', 'Finland', 'France', 'Germany', 'Ghana',
       'Iceland', 'Iran', 'Ireland', 'Japan', 'Jordan', 'Lebanon',
       'Mauritania', 'Myanmar', 'Netherlands', 'New Zealand', 'Oman',
       'Pakistan', 'Panama', 'Poland', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Sri Lanka', 'Sudan', 'Swaziland',
       'Switzerland', 'Taiwan', 'Tanzania', 'Thailand',
       'Trinidad and Tobago', 'Uganda', 'West Bank and Gaza'],
      dtype=object)

In [194]:
len(df_gap[df_gap['country'].str.contains('land|an')]['country'].unique())

39

In [195]:
df_gap['country'].str[:3] + '*******'

0       Afg*******
1       Afg*******
2       Afg*******
3       Afg*******
4       Afg*******
           ...
1699    Zim*******
1700    Zim*******
1701    Zim*******
1702    Zim*******
1703    Zim*******
Name: country, Length: 1704, dtype: object

In [196]:
df_gap['country2'] = df_gap['country'].str[:3] + '*******'

## 데이타프레임 결과 csv 저장하기 

데이타프레임.to_csv(fileURL, index=False, encoding='utf-8/cp949') <br>
index=False 인덱스 없이 저장

In [197]:
df_gap[['country', 'year', 'pop']].to_csv('output/df_gap1.csv', index=False)

# 결측값 처리 

```
np.nan : 넘파이 결측값 

NaN = Not A Number

아무것도 없다. 누락값. 결측치 

isnull() : 결측값이 있는 경우 True
notnull() : 결측값이 없는 경우 True

시리즈변수.isnull()
데이타프레임[컬럼명].isnull()
isnull().sum(), isnull().count() 결측값의 갯수

결측값이 있는 데이타 조회
데이타프레임.loc[데이타프레임.isnull()[NaN값이 있는 열], :]

```

In [198]:
# 결측값이 있는 시리즈 생성 
s1 = pd.Series([np.nan, 10, 200, np.nan,  -7, np.nan, 0])
s1

0      NaN
1     10.0
2    200.0
3      NaN
4     -7.0
5      NaN
6      0.0
dtype: float64

In [199]:
# NaN 은 True 반환 
s1.isnull()

0     True
1    False
2    False
3     True
4    False
5     True
6    False
dtype: bool

In [200]:
# NaN 은 False 반환 
s1.notnull()

0    False
1     True
2     True
3    False
4     True
5    False
6     True
dtype: bool

In [201]:
# 결측치의 갯수는?
s1.isnull().sum()

3

In [202]:
# 결측치가 아니것의 갯수는?
s1.notnull().sum(), s1.count()

(4, 4)

In [203]:
# 결측값이 있는 데이타프레임 생성 
df = pd.DataFrame(np.arange(1,21).reshape(5,4))
df.index = ['row'+str(i) for i in range(1,6)]
df.columns = ['col'+str(i) for i in range(1,5)]
# 결측치 값 강제적으로 삽입 
df.loc['row1','col2'] = np.nan
df.loc['row4','col1'] = np.nan
df.loc['row5','col4'] = np.nan
df.iloc[1,2] = np.nan
df

      col1  col2  col3  col4
row1   1.0   NaN   3.0   4.0
row2   5.0   6.0   NaN   8.0
row3   9.0  10.0  11.0  12.0
row4   NaN  14.0  15.0  16.0
row5  17.0  18.0  19.0   NaN

In [204]:
# 결측치가 있는 데이타는 True 
df.isnull()

       col1   col2   col3   col4
row1  False   True  False  False
row2  False  False   True  False
row3  False  False  False  False
row4   True  False  False  False
row5  False  False  False   True

In [205]:
# 각 컬럼의 결측치가 표시 
df.isnull().sum()

col1    1
col2    1
col3    1
col4    1
dtype: int64

In [206]:
# 결측치가 있는 데이타 조회 
df.loc[df.isnull()['col1'], :]

      col1  col2  col3  col4
row4   NaN  14.0  15.0  16.0

In [207]:
df[df.isnull()['col1']]

      col1  col2  col3  col4
row4   NaN  14.0  15.0  16.0

## NaN 값이 들어있는 행 삭제하기
- 데이타프레임이름.dropna(how="any",  inplace=False/True) : 결측값이 하나라도 있다면 삭제 
- 데이타프레임이름.dropna(how="all",  inplace=False/True) : 결측값이 모두 있다면 삭제

In [208]:
# 결측값이 있는 데이타프레임 생성 
df = pd.DataFrame(np.arange(1,21).reshape(5,4))
df.index = ['row'+str(i) for i in range(1,6)]
df.columns = ['col'+str(i) for i in range(1,5)]
df.loc['row1','col2'] = np.nan
df.loc['row4','col1'] = np.nan
df.loc['row5','col1'] = np.nan
df.loc['row5','col2'] = np.nan
df.loc['row5','col3'] = np.nan
df.loc['row5','col4'] = np.nan
df

      col1  col2  col3  col4
row1   1.0   NaN   3.0   4.0
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0
row4   NaN  14.0  15.0  16.0
row5   NaN   NaN   NaN   NaN

In [209]:
# 하나라도 결측치가 있다면 삭제 
df.dropna(how="any")

      col1  col2  col3  col4
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0

In [210]:
df

      col1  col2  col3  col4
row1   1.0   NaN   3.0   4.0
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0
row4   NaN  14.0  15.0  16.0
row5   NaN   NaN   NaN   NaN

In [211]:
# 모든 행의 값이 결측치
df.dropna(how="all", inplace=True)

## NaN값에 특정 값 입력하기

데이타프레임이름.fillna(value=값)

In [212]:
# 결측값이 있는 데이타프레임 생성 
df = pd.DataFrame(np.arange(1,21).reshape(5,4))
df.index = ['row'+str(i) for i in range(1,6)]
df.columns = ['col'+str(i) for i in range(1,5)]
df.loc['row1','col2'] = np.nan
df.loc['row4','col1'] = np.nan
df.loc['row5','col1'] = np.nan
df.loc['row5','col2'] = np.nan
df.loc['row5','col3'] = np.nan
df.loc['row5','col4'] = np.nan
df

      col1  col2  col3  col4
row1   1.0   NaN   3.0   4.0
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0
row4   NaN  14.0  15.0  16.0
row5   NaN   NaN   NaN   NaN

In [213]:
df.fillna(0)

      col1  col2  col3  col4
row1   1.0   0.0   3.0   4.0
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0
row4   0.0  14.0  15.0  16.0
row5   0.0   0.0   0.0   0.0

In [214]:
df

      col1  col2  col3  col4
row1   1.0   NaN   3.0   4.0
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0
row4   NaN  14.0  15.0  16.0
row5   NaN   NaN   NaN   NaN

In [215]:
# 평균값으로 결측치 채우기 
df.fillna(df.mean(), inplace=True)

In [216]:
df

      col1  col2  col3  col4
row1   1.0  10.0   3.0   4.0
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0
row4   5.0  14.0  15.0  16.0
row5   5.0  10.0   9.0  10.0

# quiz 2

## quiz 1-1
```
아래의 데이타를 이용하여 데이타프레임을 생성하여라.
name_list는 인덱스로 이용한다. 

data = {'kor':[40, 55, 66, 77, 34],
        'math':[70, 55, 66, 20, 40],
        'eng':[80, 95, 100, 77, 90]}
        
name_list = ['고길동','김희동','신윤지','이민호','박준희']        
```

In [3]:
data = {'kor':[40, 55, 66, 77, 34],
        'math':[70, 55, 66, 20, 40],
        'eng':[80, 95, 100, 77, 90]}

name_list = ['고길동','김희동','신윤지','이민호','박준희']   
df = pd.DataFrame(data, index= name_list)

In [7]:
## Nlargest : 특정 column을 기준으로 가장 큰 결과를 배출한다.

df.nlargest(3, 'math', keep = "last")

     kor  math  eng
고길동   40    70   80
신윤지   66    66  100
김희동   55    55   95

In [8]:
df.nlargest(3, 'math', keep = "all")

     kor  math  eng
고길동   40    70   80
신윤지   66    66  100
김희동   55    55   95

In [9]:
df.nsmallest(3, 'math', keep = 'all')

     kor  math  eng
이민호   77    20   77
박준희   34    40   90
김희동   55    55   95

## Q1-2
```
2명의 데이타를 추가하여라. 

신머신	55	67	88
윤파이	90	100	90
```

In [219]:
df.loc['신머신']= [55, 67,88]
df.loc['윤파이']= [90,100,90]

## Q1-3
sci 과목의 데이타를 추가하여라 

90, 45, 77, 90, 67, 90, 80

In [220]:
df.insert(3, "sci", [90, 45, 77, 90, 67, 90, 80])

## Q1-4
eng 과목에서 eng 평균점수보다 높은 학생은?

In [221]:
df[df.eng > df.eng.mean()]

     kor  math  eng  sci
김희동   55    55   95   45
신윤지   66    66  100   77
박준희   34    40   90   67
윤파이   90   100   90   80

## Q1-5
```
전체 과목의 평균을 구한 후 평균이상이면 O, 평균미만이면 X를 pass 컬럼에 출력하여라.
```

In [223]:
df['avg'] = df.mean(axis=1)

In [225]:
df['pass'] = ''
for a in range(len(df)):
    if df.avg[a] > df.avg.mean():
        df['pass'][a] = "o"
    else:
        df['pass'][a] = "X"

## Q 2-1
아래의 리스트를 이용하여 df_student 데이타프레임을 생성하여라 

```
student_list = [ { 'name' : 'John', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Nate', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Abrabam', 'major' : 'Physics', 'gender' : 'male'},
                 { 'name' : 'Brian', 'major' : 'Psychology', 'gender' : 'male'},
                 { 'name' : 'Jenny', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Yuba', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Jennifer', 'major' : 'Computer Science', 'gender' : 'female'},
                 { 'name' : 'Edward', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Sara', 'major' : 'Psychology', 'gender' : 'female'},
                 { 'name' : 'Wendy', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Sera', 'major' : 'Psychology', 'gender' : 'female'}
               ]
```

In [226]:
student_list = [ { 'name' : 'John', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Nate', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Abrabam', 'major' : 'Physics', 'gender' : 'male'},
                 { 'name' : 'Brian', 'major' : 'Psychology', 'gender' : 'male'},
                 { 'name' : 'Jenny', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Yuba', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Jennifer', 'major' : 'Computer Science', 'gender' : 'female'},
                 { 'name' : 'Edward', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Sara', 'major' : 'Psychology', 'gender' : 'female'},
                 { 'name' : 'Wendy', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Sera', 'major' : 'Psychology', 'gender' : 'female'}
               ]
df_st = pd.DataFrame(student_list)

## Q 2-2
df_student 데이타프레임의 인덱스를 std1 ~ std11 형태로 변경하여라

In [228]:
df_st.index = ["std"+ str(a+1) for a in df_st.index]

In [229]:
df_st

           name             major  gender
std1       John  Computer Science    male
std2       Nate  Computer Science    male
std3    Abrabam           Physics    male
std4      Brian        Psychology    male
std5      Jenny         Economics  female
std6       Yuba         Economics  female
std7   Jennifer  Computer Science  female
std8     Edward  Computer Science    male
std9       Sara        Psychology  female
std10     Wendy         Economics  female
std11      Sera        Psychology  female

## Q 2-3
df_student 데이타프레임에서 gender 컬럼이 female 값을 가진 데이타만 별도로 데이타프레임 df_student_female 로 생성하여라.

In [231]:
df_st_fe = df_st[df_st.gender=="female"]
df_st_fe

           name             major  gender
std5      Jenny         Economics  female
std6       Yuba         Economics  female
std7   Jennifer  Computer Science  female
std9       Sara        Psychology  female
std10     Wendy         Economics  female
std11      Sera        Psychology  female

## Q 2-4
df_student_female 데이타프레임에서 name 컬럼을 인덱스로 설정하고 gender 컬럼을 삭제하여라

In [232]:
df_st_fe.set_index('name')[['major']]

                     major
name
Jenny            Economics
Yuba             Economics
Jennifer  Computer Science
Sara            Psychology
Wendy            Economics
Sera            Psychology

## Q 2-5
df_student 데이타프레임에서 'Computer Science' 과를 제외한 나머지 데이타로 데이타프레임 df_student2를 생성하여라. 이때 인덱스는 name 컬럼으로 변경한다

In [233]:
df_st2 = df_st[df_st.major != "Computer Science"].set_index("name")

In [234]:
df_st2

              major  gender
name
Abrabam     Physics    male
Brian    Psychology    male
Jenny     Economics  female
Yuba      Economics  female
Sara     Psychology  female
Wendy     Economics  female
Sera     Psychology  female

## Q 2-6
df_student2 에서 Brian, Sara의 데이타를 삭제하고 grade 컬럼을 추가하여라 

4.5, 4.0, 3.5, 4.0, 3.0

In [235]:
df_student2 = df_st2.drop(['Brian', 'Sara'])

In [236]:
df_student2.insert(2, "grade", [4.5, 4.0, 3.5, 4.0, 3.0])

In [237]:
df_student2

              major  gender  grade
name
Abrabam     Physics    male    4.5
Jenny     Economics  female    4.0
Yuba      Economics  female    3.5
Wendy     Economics  female    4.0
Sera     Psychology  female    3.0

## Q 2-7
df_student2 데이타프레임에서 grade 컬럼명을 score로 변경하고 <br>
전체 컬럼 순서를 gender, score, major 순서로 변경하여라

In [238]:
df_student2.columns

Index(['major', 'gender', 'grade'], dtype='object')

In [239]:
df_student2.columns= ['major', 'gender', "score"] 

## rename으로도 해결가능

In [240]:
df_student2[["gender", "score", "major"]]

         gender  score       major
name
Abrabam    male    4.5     Physics
Jenny    female    4.0   Economics
Yuba     female    3.5   Economics
Wendy    female    4.0   Economics
Sera     female    3.0  Psychology

## Q 2-8
df_student2.describe() 명령을 이용하여 아래와 같이 출력하여라

In [241]:
df_student2.describe().loc[["mean", "25%", "50%", "75%"]]

      score
mean    3.8
25%     3.5
50%     4.0
75%     4.0

## Q3-1
```
아래의 CSV 파일을 df_weather 데이타프레임으로 생성하여라. 
이때 컬럼은 일시, 평균기온, 최고기온, 최저기온 으로만 한다 

기상온도_서울202012.csv

```

In [243]:
df_weather = pd.read_csv('data/기상온도_서울202012.csv', encoding='cp949', usecols = [2, 3, 5, 8])

## Q3-2
```
df_weather 데이타프레임에서 결측값이 각 컬럼별로 몇개가 있는지 출력하여라 
```

In [244]:
for a in df_weather. columns:
    n = sum(pd.isna(df_weather[a]))
    print("{}행의 결측치는 {}개".format(a, n))

일시행의 결측치는 8개
평균기온(℃)행의 결측치는 33개
최고기온(℃)행의 결측치는 33개
최저기온(℃)행의 결측치는 33개

## Q3-3
```
df_weather 데이타프레임에서 '일시' 컬럼값이 결측값 NaN으로 지정된 데이타를 출력하여라 
```

In [245]:
df_weather[pd.isna(df_weather['일시'])]

       일시  평균기온(℃)  최고기온(℃)  최저기온(℃)
1345  NaN      NaN      NaN      NaN
1346  NaN      NaN      NaN      NaN
1347  NaN      NaN      NaN      NaN
1348  NaN      NaN      NaN      NaN
1349  NaN      NaN      NaN      NaN
1350  NaN      NaN      NaN      NaN
1351  NaN      NaN      NaN      NaN
1352  NaN      NaN      NaN      NaN

## Q3-4
```
df_weather 데이타프레임에서 행 모두의 값이 NaN이면 삭제하여라 
```

In [246]:
df_weather.dropna(how = "all")

              일시  평균기온(℃)  최고기온(℃)  최저기온(℃)
0     1907-10-01     13.9     25.4      3.3
1     1907-11-01      5.3     21.3     -8.9
2     1907-12-01     -3.9      9.0    -20.1
3     1908-01-01     -3.5      6.2    -14.3
4     1908-02-01     -4.0      8.4    -15.8
...          ...      ...      ...      ...
1340  2020-08-01     26.5     34.5     21.5
1341  2020-09-01     21.4     29.5     13.6
1342  2020-10-01     14.3     23.6      3.2
1343  2020-11-01      8.0     20.0     -3.6
1344  2020-12-01     -0.2      9.4    -11.2

[1345 rows x 4 columns]

## Q3-5
```
df_weather 데이타프레임에서 결측값을 모두 0으로 변경하여라
```

In [247]:
df_weather.fillna(0)

              일시  평균기온(℃)  최고기온(℃)  최저기온(℃)
0     1907-10-01     13.9     25.4      3.3
1     1907-11-01      5.3     21.3     -8.9
2     1907-12-01     -3.9      9.0    -20.1
3     1908-01-01     -3.5      6.2    -14.3
4     1908-02-01     -4.0      8.4    -15.8
...          ...      ...      ...      ...
1348           0      0.0      0.0      0.0
1349           0      0.0      0.0      0.0
1350           0      0.0      0.0      0.0
1351           0      0.0      0.0      0.0
1352           0      0.0      0.0      0.0

[1353 rows x 4 columns]

## Q3-6
```
df_weather 데이타프레임에서 '일시' 컬럼의 데이타형을 시계열 형태로 변경하고 인덱스로 설정하여라. 
```

In [248]:
df_weather = df_weather.dropna()

In [250]:
df_weather['일시'] = pd.to_datetime(df_weather['일시'])

In [251]:
df_weather.set_index('일시')

            평균기온(℃)  최고기온(℃)  최저기온(℃)
일시
1907-10-01     13.9     25.4      3.3
1907-11-01      5.3     21.3     -8.9
1907-12-01     -3.9      9.0    -20.1
1908-01-01     -3.5      6.2    -14.3
1908-02-01     -4.0      8.4    -15.8
...             ...      ...      ...
2020-08-01     26.5     34.5     21.5
2020-09-01     21.4     29.5     13.6
2020-10-01     14.3     23.6      3.2
2020-11-01      8.0     20.0     -3.6
2020-12-01     -0.2      9.4    -11.2

[1320 rows x 3 columns]

In [252]:
df_weather.dtypes

일시         datetime64[ns]
평균기온(℃)           float64
최고기온(℃)           float64
최저기온(℃)           float64
dtype: object

## Q3-7
```
df_weather 데이타프레임에서 2000 이후의 데이타만 출력하여라 
```

In [253]:
df_weather[df_weather['일시'] >= pd.to_datetime("2001.01.01")]

             일시  평균기온(℃)  최고기온(℃)  최저기온(℃)
1105 2001-01-01     -4.1      6.8    -18.6
1106 2001-02-01     -0.3     12.2    -10.4
1107 2001-03-01      5.0     21.0     -6.1
1108 2001-04-01     13.6     28.2      2.1
1109 2001-05-01     19.1     31.5     10.4
...         ...      ...      ...      ...
1340 2020-08-01     26.5     34.5     21.5
1341 2020-09-01     21.4     29.5     13.6
1342 2020-10-01     14.3     23.6      3.2
1343 2020-11-01      8.0     20.0     -3.6
1344 2020-12-01     -0.2      9.4    -11.2

[240 rows x 4 columns]

# quiz3

## Q1-1

```
아래의 파일을 이용하여 df_covid 데이타프레임을 생성하여라.
   
seoul-covid19_6_30_.csv    

```

In [280]:
df_covid = pd.read_csv('data/seoul-covid19_6_30_.csv')

In [281]:
df_covid

        연번     환자    확진일   거주지     여행력          접촉력         조치사항
0     1321  12830  6.30.  영등포구       -  영등포구 확진자 접촉            -
1     1320  12829  6.30.   관악구       -         확인 중        보라매병원
2     1319  12831  6.30.  영등포구       -         확인 중      중앙대학교병원
3     1318  12808  6.30.   관악구       -   강남구 역삼동 모임        보라매병원
4     1317  12809  6.30.   관악구       -   강남구 역삼동 모임        보라매병원
...    ...    ...    ...   ...     ...          ...          ...
1316     5      9  1.31.   성북구       -        #5 접촉    서울의료원(퇴원)
1317     4      7  1.30.   마포구  중국 우한시        해외 접촉    서울의료원(퇴원)
1318     3      6  1.30.   종로구       -        #3 접촉  서울대학교병원(퇴원)
1319     2      5  1.30.   중랑구  중국 우한시        해외 접촉    서울의료원(퇴원)
1320     1      2  1.24.   강서구  중국 우한시        해외 접촉  국립중앙의료원(퇴원)

[1321 rows x 7 columns]

## Q1-2
```
'연번' 컬럼은 삭제하고  '환자' 컬럼 값 기준으로 정렬한 후 '환자' 컬럼을 인덱스로 설정하여라. 
```

In [282]:
df_covid = df_covid.drop('연번', 1).sort_values('환자').set_index('환자')

## Q1-3
어느 지역에서 제일 많은 확진자가 발생했는지 1~5위 까지 출력하여라 (거주지 기준)

In [283]:
df_covid.거주지.value_counts()[:5]

관악구    117
구로구     86
강남구     83
강서구     78
양천구     70
Name: 거주지, dtype: int64

## Q1-4
확진자가 가장 많이 발생한 1, 2, 3위 지역의 데이타만 출력하여라

In [284]:
df_covid[(df_covid.거주지=="관악구")|(df_covid.거주지=="구로구")|(df_covid.거주지=="강남구")]

         확진일  거주지 여행력          접촉력         조치사항
환자
348    2.22.  구로구   -   타시도 확진자 접촉  국립중앙의료원(퇴원)
935    2.25.  관악구   -          확인중   삼육서울병원(퇴원)
1247   2.26.  강남구   -   신천지대구교회 관련     서남병원(퇴원)
1295   2.26.  관악구   -        대구 방문    서울백병원(퇴원)
1710   2.26.  강남구   -        대구 방문     서남병원(퇴원)
...      ...  ...  ..          ...          ...
12748  6.28.  관악구   -  영등포구 확진자 접촉        보라매병원
12785  6.30.  관악구   -  영등포구 확진자 접촉         서북병원
12808  6.30.  관악구   -   강남구 역삼동 모임        보라매병원
12809  6.30.  관악구   -   강남구 역삼동 모임        보라매병원
12829  6.30.  관악구   -         확인 중        보라매병원

[286 rows x 5 columns]

## Q1-5
'확진일' 컬럼값을 아래와 같은 형태로 변경하여라
<br>
'1.24.' => '2020-1-24'

In [285]:
## 방법 1
def change(x):
    # 2020- + .를 - 로 대체     
    result = '2020-'+x.replace('.','-')
    # 마지막 . 제외하고 나머지를 리턴 
    return result[:-1]

In [286]:
df_covid['확진일'] = df_covid['확진일'].apply(change)

In [278]:
## 방법2. 왜 문제가 났는지 살펴보기.
for a in df_covid.index:
    df_covid.확진일[a] = "2020." + str(df_covid.확진일[a][:-1])

## Q1-6
'확진일' 컬럼을 시계열 데이타로 형태를 변경하여라

In [287]:
df_covid['확진일'] = pd.to_datetime(df_covid['확진일'])

## Q1-7

3월에 발생한 확진자의 데이타만 출력하여라.

In [288]:
# dt.year, dt.month, dt.day, dt.weekday

df_covid[df_covid['확진일'].dt.month == 3]

             확진일   거주지    여행력           접촉력        조치사항
환자
3616  2020-03-01   강남구      -  부동산 중개 법인 관련   서울의료원(퇴원)
3790  2020-03-01   광진구      -    성동구 아파트 관련   서울의료원(퇴원)
3793  2020-03-01   성북구      -    성동구 아파트 관련   서울의료원(퇴원)
3815  2020-03-01  영등포구      -    성동구 아파트 관련   서울의료원(퇴원)
4224  2020-03-02  영등포구      -    성동구 아파트 관련    서북병원(퇴원)
...          ...   ...    ...           ...         ...
9886  2020-03-31  영등포구  오스트리아      해외 접촉 추정   보라매병원(퇴원)
9912  2020-03-31   양주시      -          확인 중  서울아산병원(퇴원)
9929  2020-03-31   광진구     영국      해외 접촉 추정    건대병원(퇴원)
10079 2020-03-30   용산구     영국      해외 접촉 추정   서울의료원(퇴원)
10081 2020-03-31   관악구   아일랜드      해외 접촉 추정    서남병원(퇴원)

[391 rows x 5 columns]


## Q1-8
주말에 발생한 확진자의 데이타만 출력하여라.

## Q1-9
'콜센터'와 관련된 확진자의 데이타를 출력하여라.

In [289]:
# 콜센터와 관련된 확진자의 데이타를 출력하여라. 
# (접촉력 컬럼에 콜센터 글자가 포함된 데이타)
df_covid['접촉력'].unique()

array(['해외 접촉', '#3 접촉', '#5 접촉', '#6 접촉', '#83 접촉', '#29 접촉',
       '성동구 아파트 관련', '#30 접촉', '#6 접촉(추정)', '대구 거주자', '#136 접촉', '#56 접촉',
       '은평구 병원 관련', '신천지 추정', '타시도 확진자 접촉', '대구 방문', '#780 접촉(추정)', '확인중',
       '대구 방문(명성교회)', '해외 접촉 추정', '대구 확진자 접촉', '#794 접촉자', '명성교회 관련',
       '신천지대구교회 관련', '서울재생병원 관련', '경찰병원관련', '쇼핑몰 관련', '부동산 중개업 관련',
       '#1247 접촉(추정)', '#2621번 접촉', '#794 접촉(추정)', '여의도 건설현장 관련',
       '부동산 중개 법인 관련', '동대문구 관련', '#6832 접촉자', '#6937 접촉자', '#935 접촉자',
       '#6921접촉자', '대구 거주', '구로구 콜센터 관련', '#6727 첩촉', '콜센터직원 접촉',
       '#7280 접촉(추정)', '#7500 접촉(추정)', '#6959 접촉(추정)', '#7573 접축 추정',
       '#7923 접촉', '#8044 접촉', '구로구 콜센터 접촉', '#8138 접촉', '#8196 접촉',
       '#8271 접촉', '#8486 접촉', '#8245 접촉', '#8063 접촉', '#8881 접촉 추정',
       '#8791 접촉', '#8717 접촉', '#8709 접촉 추정', '#8646 접촉', '#8079 접촉',
       '#9020 접촉', '구로구 교회 관련', '#8057 접촉', '#9219 접촉', '#7914 접촉',
       '#8669 접촉', '#9525 접촉', '#9572 접촉', '#9734 접촉', '#9621 접촉', '확인 중',
       '#9946 접촉', '#10084 접촉', '#8601 접촉', '#9287 접촉', '#9912 접촉',
       '타시도 확진자 접촉(추정)', '#10115 접촉', '#9765 접촉', '#10044 접촉',
       '#10142 접촉', '#10377 접촉', '#9364 접촉', '#10015 접촉', '#10407 접촉',
       '#9641 접촉', '#9800 접촉', '#10054 접촉', '이태원 클럽 관련', '삼성서울병원 관련',
       '원어성경연구회 관련', '#11196 접촉', '부천시 쿠팡 관련', '강남구 동인교회 관련',
       'kb 생명보험 관련', '영등포 학원 관련', '한국대학생선교회 관련', '연아나뉴스클래스 관련',
       '서초구 가족관련', '수도권 개척교회 관련', '리치웨이 관련', '서초구 가족 관련', '안양군포 목회자 관련',
       '삼성화재 관련', '양천구 운동시설 관련', '용인 형제 관련', '요양시설 관련', '해외접촉 추정',
       '대전 꿈꾸는 교회', '타시도 확진자 접촉자', '대자연코리아', '금천구 도정기 회사 관련',
       '서초구 확진자 접촉', '은평구 확진자 접촉', '오렌지라이프 관련', '시청역 관련', '대전 다단계 관련',
       '의왕 물류센터 관련', '강동구 확진자 접촉', '동작구 확진자 접촉', '구로구 확진자 접촉', '왕성교회 관련',
       '관악구 확진자 접촉', '강서구 확진자 접촉', '금천구 확진자 접촉', '강남구 역삼동 모임',
       '용산구 확진자 접촉', '영등포구 확진자 접촉'], dtype=object)

In [290]:
df_covid[df_covid['접촉력'].str.contains('콜센터')]['접촉력'].unique()

array(['구로구 콜센터 관련', '콜센터직원 접촉', '구로구 콜센터 접촉'], dtype=object)

## Q1-10
'우한'과 관련된 확진자의 데이타만 출력하여라.

In [291]:
df_covid[df_covid.여행력.str.contains("우한")]

          확진일   거주지     여행력    접촉력         조치사항
환자
2  2020-01-24   강서구  중국 우한시  해외 접촉  국립중앙의료원(퇴원)
5  2020-01-30   중랑구  중국 우한시  해외 접촉    서울의료원(퇴원)
7  2020-01-30   마포구  중국 우한시  해외 접촉    서울의료원(퇴원)
13 2020-02-02   인천시   우한 교민  해외 접촉  국립중앙의료원(퇴원)
23 2020-02-06  서대문구  중국 우한시  해외 접촉  국립중앙의료원(퇴원)
24 2020-02-07   아산시    우한교민  해외 접촉  국립중앙의료원(퇴원)

## Q1-11
사망자는 모두 몇명인가?

In [292]:
df_covid[df_covid.조치사항.str.contains("사망")]

             확진일   거주지 여행력         접촉력         조치사항
환자
29    2020-02-16   종로구   -      #83 접촉  서울대학교병원(사망)
6773  2020-03-07   고양시   -  타시도 확진자 접촉    서울의료원(사망)
8602  2020-03-19   마포구   -    콜센터직원 접촉   세브란스병원(사망)
9870  2020-03-31   수원시   -    #9734 접촉   타시도 이관(사망)
11826 2020-06-08  서대문구   -        확인 중   세브란스병원(사망)
11984 2020-06-11   도봉구   -     요양시설 관련     서남병원(사망)
12103 2020-06-14   부천시   -        확인 중   삼육서울병원(사망)

## Q2-1

아래의 파일을 이용하여 데이타프레임을 생성하여라.<br>
   
전국 평균 분양가격.csv 


```

In [293]:
df = pd.read_csv('data/전국 평균 분양가격.csv', encoding ='cp949')



## Q2-2

행과 열을 아래의 명령어를 이용하여 서로 변경하여라.  (df는 데이타프레임명)
```
df = df.T

In [294]:
df = df.T

## Q2-3

1행을 삭제하고 2행을 컬럼으로 지정하여라.

In [295]:
# 1행을 컬럼으로 지정하여라 
# df[0]
df.columns = df.iloc[0]

In [300]:
df = df.iloc[1:]
df

지역,서울,부산,대구,인천,광주,대전,울산,경기,세종,강원,충북,충남,전북,전남,경북,경남,제주
2014년1월,17925,8111,8080,10204,7326,8321,8090,10855,7600,6230,6589,6365,6281,5678,6168,6485,7900
2014년2월,17925,9078,8077,10408,7611,8321,8090,10791,7532,6230,6611,6379,5946,5678,6234,6502,7900
2014년3월,18016,8965,8101,10408,7346,8341,8153,10784,7814,6141,6625,6287,5966,5696,6317,6610,7900
2014년4월,18098,9402,8267,10000,7346,8341,8153,10876,7908,6373,6678,6552,6277,5736,6412,6599,7900
2014년5월,19446,9501,8274,9844,7523,8341,8153,10646,7934,6350,6598,6591,6306,5656,6409,6610,7900
2014년6월,18867,9453,8360,10058,7659,8333,8153,10266,8067,6350,6587,6644,6351,5609,6554,6615,7914
2014년7월,18742,9457,8360,9974,7612,8333,8153,10124,8067,6268,6586,6805,6319,5780,6556,6613,7914
2014년8월,19274,9411,8370,9973,7622,8333,8493,10134,8141,6268,6586,6914,6436,5685,6563,6606,7914
2014년9월,19404,9258,8449,9973,7802,8048,8493,10501,8282,6419,6584,6882,6719,5804,6577,6767,7833
2014년10월,19759,9110,8403,10016,7707,8038,8627,10397,8527,6631,6529,6831,6581,5753,6778,6881,7724
2014년11월,20242,9208,8439,10020,7752,8067,8891,10356,8592,6365,6724,6940,6583,5768,6881,7125,7724
2014년12월,20269,9208,8253,10020,7748,8067,8891,10379,8560,6365,6743,6989,6583,5784,6989,7332,7739
2015년1월,20670,9204,8327,10017,7752,8067,8526,10391,8560,6348,6749,6976,6583,5784,6992,7592,7739
2015년2월,20670,9235,8416,9876,7756,8067,8526,10355,8560,6350,6747,6980,6583,5833,6953,7588,7739
2015년3월,19415,9279,8441,9876,7861,8067,8629,10469,8555,6182,6783,7161,6542,5825,6997,7668,7826
2015년4월,18842,9327,8446,9938,7914,8145,9380,10684,8546,6924,6790,7017,6551,5940,7006,7683,7285
2015년5월,18367,9345,8568,10551,7877,8272,9192,10685,8546,6846,6805,6975,6556,6050,6966,7717,7285
2015년6월,18374,9515,8542,10443,7881,8079,9190,10573,8671,6986,6682,6939,6601,6243,6887,7715,7343
2015년7월,18152,9559,8542,10443,8089,8079,9190,10518,8669,7019,6601,6935,6750,6286,7035,7723,7343
2015년8월,18443,9581,8795,10449,8231,8079,9215,10573,8695,7008,6603,6942,6580,6289,7037,7665,7343

## Q2-4

'지역' 컬럼을 시계열 데이타로 변경하고 인덱스로 설정하여라. 

### 다시 살펴보기. 추가 복습

In [316]:
list(map(lambda x:x.replace('년','-').replace('월',''), df.index))

['2014-1',
 '2014-2',
 '2014-3',
 '2014-4',
 '2014-5',
 '2014-6',
 '2014-7',
 '2014-8',
 '2014-9',
 '2014-10',
 '2014-11',
 '2014-12',
 '2015-1',
 '2015-2',
 '2015-3',
 '2015-4',
 '2015-5',
 '2015-6',
 '2015-7',
 '2015-8']

In [317]:
date_result = list(map(lambda x:x.replace('년','-').replace('월',''), df.index))
print(date_result)

['2014-1', '2014-2', '2014-3', '2014-4', '2014-5', '2014-6', '2014-7', '2014-8', '2014-9', '2014-10', '2014-11', '2014-12', '2015-1', '2015-2', '2015-3', '2015-4', '2015-5', '2015-6', '2015-7', '2015-8']

In [321]:
df.index= pd.to_datetime(date_result)

## Q2-5 2015년 6월 이후의 데이타만 출력하여라

In [326]:
df['2015-06':]

지역,서울,부산,대구,인천,광주,대전,울산,경기,세종,강원,충북,충남,전북,전남,경북,경남,제주
2015-06-01,18374,9515,8542,10443,7881,8079,9190,10573,8671,6986,6682,6939,6601,6243,6887,7715,7343
2015-07-01,18152,9559,8542,10443,8089,8079,9190,10518,8669,7019,6601,6935,6750,6286,7035,7723,7343
2015-08-01,18443,9581,8795,10449,8231,8079,9215,10573,8695,7008,6603,6942,6580,6289,7037,7665,7343

## Q2-6
2014년도의 서울, 인천 경기 컬럼만 출력하여라.

In [331]:
df.loc['2014', ["서울", "인천", "경기"]]

지역             서울     인천     경기
2014-01-01  17925  10204  10855
2014-02-01  17925  10408  10791
2014-03-01  18016  10408  10784
2014-04-01  18098  10000  10876
2014-05-01  19446   9844  10646
2014-06-01  18867  10058  10266
2014-07-01  18742   9974  10124
2014-08-01  19274   9973  10134
2014-09-01  19404   9973  10501
2014-10-01  19759  10016  10397
2014-11-01  20242  10020  10356
2014-12-01  20269  10020  10379

## Q2-7
 csv 파일 형태로 현재의 데이타프레임을 저장하여라.
 output/평균분양가격_서울인천경기.csv

In [ ]:
%%writefile